Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_QSPI_TLE9180D_2/Libraries/Infra/Sfr/TC38x/IfxEray_bf.h
/** \brief Offset for Ifx_ERAY_EIR_Bits.EERR */
#define IFX_ERAY_EIR_EERR_OFF (6u)

/** \brief Length for Ifx_ERAY_EIR_Bits.RFO */
#define IFX_ERAY_EIR_RFO_LEN (1u)

/** \brief Mask for Ifx_ERAY_EIR_Bits.RFO */
#define IFX_ERAY_EIR_RFO_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_EIR_Bits.RFO */
#define IFX_ERAY_EIR_RFO_OFF (7u)

/** \brief Length for Ifx_ERAY_EIR_Bits.EFA */
#define IFX_ERAY_EIR_EFA_LEN (1u)

/** \brief Mask for Ifx_ERAY_EIR_Bits.EFA */
#define IFX_ERAY_EIR_EFA_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_EIR_Bits.EFA */
#define IFX_ERAY_EIR_EFA_OFF (8u)

/** \brief Length for Ifx_ERAY_EIR_Bits.IIBA */
#define IFX_ERAY_EIR_IIBA_LEN (1u)

/** \brief Mask for Ifx_ERAY_EIR_Bits.IIBA */
#define IFX_ERAY_EIR_IIBA_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_EIR_Bits.IIBA */
#define IFX_ERAY_EIR_IIBA_OFF (9u)

/** \brief Length for Ifx_ERAY_EIR_Bits.IOBA */
#define IFX_ERAY_EIR_IOBA_LEN (1u)

/** \brief Mask for Ifx_ERAY_EIR_Bits.IOBA */
#define IFX_ERAY_EIR_IOBA_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_EIR_Bits.IOBA */
#define IFX_ERAY_EIR_IOBA_OFF (10u)

/** \brief Length for Ifx_ERAY_EIR_Bits.MHF */
#define IFX_ERAY_EIR_MHF_LEN (1u)

/** \brief Mask for Ifx_ERAY_EIR_Bits.MHF */
#define IFX_ERAY_EIR_MHF_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_EIR_Bits.MHF */
#define IFX_ERAY_EIR_MHF_OFF (11u)

/** \brief Length for Ifx_ERAY_EIR_Bits.EDA */
#define IFX_ERAY_EIR_EDA_LEN (1u)

/** \brief Mask for Ifx_ERAY_EIR_Bits.EDA */
#define IFX_ERAY_EIR_EDA_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_EIR_Bits.EDA */
#define IFX_ERAY_EIR_EDA_OFF (16u)

/** \brief Length for Ifx_ERAY_EIR_Bits.LTVA */
#define IFX_ERAY_EIR_LTVA_LEN (1u)

/** \brief Mask for Ifx_ERAY_EIR_Bits.LTVA */
#define IFX_ERAY_EIR_LTVA_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_EIR_Bits.LTVA */
#define IFX_ERAY_EIR_LTVA_OFF (17u)

/** \brief Length for Ifx_ERAY_EIR_Bits.TABA */
#define IFX_ERAY_EIR_TABA_LEN (1u)

/** \brief Mask for Ifx_ERAY_EIR_Bits.TABA */
#define IFX_ERAY_EIR_TABA_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_EIR_Bits.TABA */
#define IFX_ERAY_EIR_TABA_OFF (18u)

/** \brief Length for Ifx_ERAY_EIR_Bits.EDB */
#define IFX_ERAY_EIR_EDB_LEN (1u)

/** \brief Mask for Ifx_ERAY_EIR_Bits.EDB */
#define IFX_ERAY_EIR_EDB_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_EIR_Bits.EDB */
#define IFX_ERAY_EIR_EDB_OFF (24u)

/** \brief Length for Ifx_ERAY_EIR_Bits.LTVB */
#define IFX_ERAY_EIR_LTVB_LEN (1u)

/** \brief Mask for Ifx_ERAY_EIR_Bits.LTVB */
#define IFX_ERAY_EIR_LTVB_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_EIR_Bits.LTVB */
#define IFX_ERAY_EIR_LTVB_OFF (25u)

/** \brief Length for Ifx_ERAY_EIR_Bits.TABB */
#define IFX_ERAY_EIR_TABB_LEN (1u)

/** \brief Mask for Ifx_ERAY_EIR_Bits.TABB */
#define IFX_ERAY_EIR_TABB_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_EIR_Bits.TABB */
#define IFX_ERAY_EIR_TABB_OFF (26u)

/** \brief Length for Ifx_ERAY_SIR_Bits.WST */
#define IFX_ERAY_SIR_WST_LEN (1u)

/** \brief Mask for Ifx_ERAY_SIR_Bits.WST */
#define IFX_ERAY_SIR_WST_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SIR_Bits.WST */
#define IFX_ERAY_SIR_WST_OFF (0u)

/** \brief Length for Ifx_ERAY_SIR_Bits.CAS */
#define IFX_ERAY_SIR_CAS_LEN (1u)

/** \brief Mask for Ifx_ERAY_SIR_Bits.CAS */
#define IFX_ERAY_SIR_CAS_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SIR_Bits.CAS */
#define IFX_ERAY_SIR_CAS_OFF (1u)

/** \brief Length for Ifx_ERAY_SIR_Bits.CYCS */
#define IFX_ERAY_SIR_CYCS_LEN (1u)

/** \brief Mask for Ifx_ERAY_SIR_Bits.CYCS */
#define IFX_ERAY_SIR_CYCS_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SIR_Bits.CYCS */
#define IFX_ERAY_SIR_CYCS_OFF (2u)

/** \brief Length for Ifx_ERAY_SIR_Bits.TXI */
#define IFX_ERAY_SIR_TXI_LEN (1u)

/** \brief Mask for Ifx_ERAY_SIR_Bits.TXI */
#define IFX_ERAY_SIR_TXI_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SIR_Bits.TXI */
#define IFX_ERAY_SIR_TXI_OFF (3u)

/** \brief Length for Ifx_ERAY_SIR_Bits.RXI */
#define IFX_ERAY_SIR_RXI_LEN (1u)

/** \brief Mask for Ifx_ERAY_SIR_Bits.RXI */
#define IFX_ERAY_SIR_RXI_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SIR_Bits.RXI */
#define IFX_ERAY_SIR_RXI_OFF (4u)

/** \brief Length for Ifx_ERAY_SIR_Bits.RFNE */
#define IFX_ERAY_SIR_RFNE_LEN (1u)

/** \brief Mask for Ifx_ERAY_SIR_Bits.RFNE */
#define IFX_ERAY_SIR_RFNE_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SIR_Bits.RFNE */
#define IFX_ERAY_SIR_RFNE_OFF (5u)

/** \brief Length for Ifx_ERAY_SIR_Bits.RFCL */
#define IFX_ERAY_SIR_RFCL_LEN (1u)

/** \brief Mask for Ifx_ERAY_SIR_Bits.RFCL */
#define IFX_ERAY_SIR_RFCL_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SIR_Bits.RFCL */
#define IFX_ERAY_SIR_RFCL_OFF (6u)

/** \brief Length for Ifx_ERAY_SIR_Bits.NMVC */
#define IFX_ERAY_SIR_NMVC_LEN (1u)

/** \brief Mask for Ifx_ERAY_SIR_Bits.NMVC */
#define IFX_ERAY_SIR_NMVC_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SIR_Bits.NMVC */
#define IFX_ERAY_SIR_NMVC_OFF (7u)

/** \brief Length for Ifx_ERAY_SIR_Bits.TI0 */
#define IFX_ERAY_SIR_TI0_LEN (1u)

/** \brief Mask for Ifx_ERAY_SIR_Bits.TI0 */
#define IFX_ERAY_SIR_TI0_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SIR_Bits.TI0 */
#define IFX_ERAY_SIR_TI0_OFF (8u)

/** \brief Length for Ifx_ERAY_SIR_Bits.TI1 */
#define IFX_ERAY_SIR_TI1_LEN (1u)

/** \brief Mask for Ifx_ERAY_SIR_Bits.TI1 */
#define IFX_ERAY_SIR_TI1_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SIR_Bits.TI1 */
#define IFX_ERAY_SIR_TI1_OFF (9u)

/** \brief Length for Ifx_ERAY_SIR_Bits.TIBC */
#define IFX_ERAY_SIR_TIBC_LEN (1u)

/** \brief Mask for Ifx_ERAY_SIR_Bits.TIBC */
#define IFX_ERAY_SIR_TIBC_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SIR_Bits.TIBC */
#define IFX_ERAY_SIR_TIBC_OFF (10u)

/** \brief Length for Ifx_ERAY_SIR_Bits.TOBC */
#define IFX_ERAY_SIR_TOBC_LEN (1u)

/** \brief Mask for Ifx_ERAY_SIR_Bits.TOBC */
#define IFX_ERAY_SIR_TOBC_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SIR_Bits.TOBC */
#define IFX_ERAY_SIR_TOBC_OFF (11u)

/** \brief Length for Ifx_ERAY_SIR_Bits.SWE */
#define IFX_ERAY_SIR_SWE_LEN (1u)

/** \brief Mask for Ifx_ERAY_SIR_Bits.SWE */
#define IFX_ERAY_SIR_SWE_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SIR_Bits.SWE */
#define IFX_ERAY_SIR_SWE_OFF (12u)

/** \brief Length for Ifx_ERAY_SIR_Bits.SUCS */
#define IFX_ERAY_SIR_SUCS_LEN (1u)

/** \brief Mask for Ifx_ERAY_SIR_Bits.SUCS */
#define IFX_ERAY_SIR_SUCS_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SIR_Bits.SUCS */
#define IFX_ERAY_SIR_SUCS_OFF (13u)

