Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_QSPI_TLE9180D_2/Libraries/Infra/Sfr/TC38x/IfxEray_bf.h
/** \brief Length for Ifx_ERAY_SIR_Bits.MBSI */
#define IFX_ERAY_SIR_MBSI_LEN (1u)

/** \brief Mask for Ifx_ERAY_SIR_Bits.MBSI */
#define IFX_ERAY_SIR_MBSI_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SIR_Bits.MBSI */
#define IFX_ERAY_SIR_MBSI_OFF (14u)

/** \brief Length for Ifx_ERAY_SIR_Bits.SDS */
#define IFX_ERAY_SIR_SDS_LEN (1u)

/** \brief Mask for Ifx_ERAY_SIR_Bits.SDS */
#define IFX_ERAY_SIR_SDS_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SIR_Bits.SDS */
#define IFX_ERAY_SIR_SDS_OFF (15u)

/** \brief Length for Ifx_ERAY_SIR_Bits.WUPA */
#define IFX_ERAY_SIR_WUPA_LEN (1u)

/** \brief Mask for Ifx_ERAY_SIR_Bits.WUPA */
#define IFX_ERAY_SIR_WUPA_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SIR_Bits.WUPA */
#define IFX_ERAY_SIR_WUPA_OFF (16u)

/** \brief Length for Ifx_ERAY_SIR_Bits.MTSA */
#define IFX_ERAY_SIR_MTSA_LEN (1u)

/** \brief Mask for Ifx_ERAY_SIR_Bits.MTSA */
#define IFX_ERAY_SIR_MTSA_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SIR_Bits.MTSA */
#define IFX_ERAY_SIR_MTSA_OFF (17u)

/** \brief Length for Ifx_ERAY_SIR_Bits.WUPB */
#define IFX_ERAY_SIR_WUPB_LEN (1u)

/** \brief Mask for Ifx_ERAY_SIR_Bits.WUPB */
#define IFX_ERAY_SIR_WUPB_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SIR_Bits.WUPB */
#define IFX_ERAY_SIR_WUPB_OFF (24u)

/** \brief Length for Ifx_ERAY_SIR_Bits.MTSB */
#define IFX_ERAY_SIR_MTSB_LEN (1u)

/** \brief Mask for Ifx_ERAY_SIR_Bits.MTSB */
#define IFX_ERAY_SIR_MTSB_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SIR_Bits.MTSB */
#define IFX_ERAY_SIR_MTSB_OFF (25u)

/** \brief Length for Ifx_ERAY_EILS_Bits.PEMCL */
#define IFX_ERAY_EILS_PEMCL_LEN (1u)

/** \brief Mask for Ifx_ERAY_EILS_Bits.PEMCL */
#define IFX_ERAY_EILS_PEMCL_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_EILS_Bits.PEMCL */
#define IFX_ERAY_EILS_PEMCL_OFF (0u)

/** \brief Length for Ifx_ERAY_EILS_Bits.CNAL */
#define IFX_ERAY_EILS_CNAL_LEN (1u)

/** \brief Mask for Ifx_ERAY_EILS_Bits.CNAL */
#define IFX_ERAY_EILS_CNAL_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_EILS_Bits.CNAL */
#define IFX_ERAY_EILS_CNAL_OFF (1u)

/** \brief Length for Ifx_ERAY_EILS_Bits.SFBML */
#define IFX_ERAY_EILS_SFBML_LEN (1u)

/** \brief Mask for Ifx_ERAY_EILS_Bits.SFBML */
#define IFX_ERAY_EILS_SFBML_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_EILS_Bits.SFBML */
#define IFX_ERAY_EILS_SFBML_OFF (2u)

/** \brief Length for Ifx_ERAY_EILS_Bits.SFOL */
#define IFX_ERAY_EILS_SFOL_LEN (1u)

/** \brief Mask for Ifx_ERAY_EILS_Bits.SFOL */
#define IFX_ERAY_EILS_SFOL_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_EILS_Bits.SFOL */
#define IFX_ERAY_EILS_SFOL_OFF (3u)

/** \brief Length for Ifx_ERAY_EILS_Bits.CCFL */
#define IFX_ERAY_EILS_CCFL_LEN (1u)

/** \brief Mask for Ifx_ERAY_EILS_Bits.CCFL */
#define IFX_ERAY_EILS_CCFL_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_EILS_Bits.CCFL */
#define IFX_ERAY_EILS_CCFL_OFF (4u)

/** \brief Length for Ifx_ERAY_EILS_Bits.CCLL */
#define IFX_ERAY_EILS_CCLL_LEN (1u)

/** \brief Mask for Ifx_ERAY_EILS_Bits.CCLL */
#define IFX_ERAY_EILS_CCLL_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_EILS_Bits.CCLL */
#define IFX_ERAY_EILS_CCLL_OFF (5u)

/** \brief Length for Ifx_ERAY_EILS_Bits.EERRL */
#define IFX_ERAY_EILS_EERRL_LEN (1u)

/** \brief Mask for Ifx_ERAY_EILS_Bits.EERRL */
#define IFX_ERAY_EILS_EERRL_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_EILS_Bits.EERRL */
#define IFX_ERAY_EILS_EERRL_OFF (6u)

/** \brief Length for Ifx_ERAY_EILS_Bits.RFOL */
#define IFX_ERAY_EILS_RFOL_LEN (1u)

/** \brief Mask for Ifx_ERAY_EILS_Bits.RFOL */
#define IFX_ERAY_EILS_RFOL_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_EILS_Bits.RFOL */
#define IFX_ERAY_EILS_RFOL_OFF (7u)

/** \brief Length for Ifx_ERAY_EILS_Bits.EFAL */
#define IFX_ERAY_EILS_EFAL_LEN (1u)

/** \brief Mask for Ifx_ERAY_EILS_Bits.EFAL */
#define IFX_ERAY_EILS_EFAL_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_EILS_Bits.EFAL */
#define IFX_ERAY_EILS_EFAL_OFF (8u)

/** \brief Length for Ifx_ERAY_EILS_Bits.IIBAL */
#define IFX_ERAY_EILS_IIBAL_LEN (1u)

/** \brief Mask for Ifx_ERAY_EILS_Bits.IIBAL */
#define IFX_ERAY_EILS_IIBAL_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_EILS_Bits.IIBAL */
#define IFX_ERAY_EILS_IIBAL_OFF (9u)

/** \brief Length for Ifx_ERAY_EILS_Bits.IOBAL */
#define IFX_ERAY_EILS_IOBAL_LEN (1u)

/** \brief Mask for Ifx_ERAY_EILS_Bits.IOBAL */
#define IFX_ERAY_EILS_IOBAL_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_EILS_Bits.IOBAL */
#define IFX_ERAY_EILS_IOBAL_OFF (10u)

/** \brief Length for Ifx_ERAY_EILS_Bits.MHFL */
#define IFX_ERAY_EILS_MHFL_LEN (1u)

/** \brief Mask for Ifx_ERAY_EILS_Bits.MHFL */
#define IFX_ERAY_EILS_MHFL_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_EILS_Bits.MHFL */
#define IFX_ERAY_EILS_MHFL_OFF (11u)

/** \brief Length for Ifx_ERAY_EILS_Bits.EDAL */
#define IFX_ERAY_EILS_EDAL_LEN (1u)

/** \brief Mask for Ifx_ERAY_EILS_Bits.EDAL */
#define IFX_ERAY_EILS_EDAL_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_EILS_Bits.EDAL */
#define IFX_ERAY_EILS_EDAL_OFF (16u)

/** \brief Length for Ifx_ERAY_EILS_Bits.LTVAL */
#define IFX_ERAY_EILS_LTVAL_LEN (1u)

/** \brief Mask for Ifx_ERAY_EILS_Bits.LTVAL */
#define IFX_ERAY_EILS_LTVAL_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_EILS_Bits.LTVAL */
#define IFX_ERAY_EILS_LTVAL_OFF (17u)

/** \brief Length for Ifx_ERAY_EILS_Bits.TABAL */
#define IFX_ERAY_EILS_TABAL_LEN (1u)

/** \brief Mask for Ifx_ERAY_EILS_Bits.TABAL */
#define IFX_ERAY_EILS_TABAL_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_EILS_Bits.TABAL */
#define IFX_ERAY_EILS_TABAL_OFF (18u)

/** \brief Length for Ifx_ERAY_EILS_Bits.EDBL */
#define IFX_ERAY_EILS_EDBL_LEN (1u)

/** \brief Mask for Ifx_ERAY_EILS_Bits.EDBL */
#define IFX_ERAY_EILS_EDBL_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_EILS_Bits.EDBL */
#define IFX_ERAY_EILS_EDBL_OFF (24u)

/** \brief Length for Ifx_ERAY_EILS_Bits.LTVBL */
#define IFX_ERAY_EILS_LTVBL_LEN (1u)

/** \brief Mask for Ifx_ERAY_EILS_Bits.LTVBL */
#define IFX_ERAY_EILS_LTVBL_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_EILS_Bits.LTVBL */
#define IFX_ERAY_EILS_LTVBL_OFF (25u)

/** \brief Length for Ifx_ERAY_EILS_Bits.TABBL */
#define IFX_ERAY_EILS_TABBL_LEN (1u)

/** \brief Mask for Ifx_ERAY_EILS_Bits.TABBL */
#define IFX_ERAY_EILS_TABBL_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_EILS_Bits.TABBL */
#define IFX_ERAY_EILS_TABBL_OFF (26u)

/** \brief Length for Ifx_ERAY_SILS_Bits.WSTL */
#define IFX_ERAY_SILS_WSTL_LEN (1u)

