Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_QSPI_TLE9180D_2/Libraries/Infra/Sfr/TC38x/IfxEray_bf.h
/** \brief Offset for Ifx_ERAY_NDAT4_Bits.ND111 */
#define IFX_ERAY_NDAT4_ND111_OFF (15u)

/** \brief Length for Ifx_ERAY_NDAT4_Bits.ND112 */
#define IFX_ERAY_NDAT4_ND112_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDAT4_Bits.ND112 */
#define IFX_ERAY_NDAT4_ND112_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDAT4_Bits.ND112 */
#define IFX_ERAY_NDAT4_ND112_OFF (16u)

/** \brief Length for Ifx_ERAY_NDAT4_Bits.ND113 */
#define IFX_ERAY_NDAT4_ND113_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDAT4_Bits.ND113 */
#define IFX_ERAY_NDAT4_ND113_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDAT4_Bits.ND113 */
#define IFX_ERAY_NDAT4_ND113_OFF (17u)

/** \brief Length for Ifx_ERAY_NDAT4_Bits.ND114 */
#define IFX_ERAY_NDAT4_ND114_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDAT4_Bits.ND114 */
#define IFX_ERAY_NDAT4_ND114_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDAT4_Bits.ND114 */
#define IFX_ERAY_NDAT4_ND114_OFF (18u)

/** \brief Length for Ifx_ERAY_NDAT4_Bits.ND115 */
#define IFX_ERAY_NDAT4_ND115_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDAT4_Bits.ND115 */
#define IFX_ERAY_NDAT4_ND115_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDAT4_Bits.ND115 */
#define IFX_ERAY_NDAT4_ND115_OFF (19u)

/** \brief Length for Ifx_ERAY_NDAT4_Bits.ND116 */
#define IFX_ERAY_NDAT4_ND116_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDAT4_Bits.ND116 */
#define IFX_ERAY_NDAT4_ND116_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDAT4_Bits.ND116 */
#define IFX_ERAY_NDAT4_ND116_OFF (20u)

/** \brief Length for Ifx_ERAY_NDAT4_Bits.ND117 */
#define IFX_ERAY_NDAT4_ND117_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDAT4_Bits.ND117 */
#define IFX_ERAY_NDAT4_ND117_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDAT4_Bits.ND117 */
#define IFX_ERAY_NDAT4_ND117_OFF (21u)

/** \brief Length for Ifx_ERAY_NDAT4_Bits.ND118 */
#define IFX_ERAY_NDAT4_ND118_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDAT4_Bits.ND118 */
#define IFX_ERAY_NDAT4_ND118_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDAT4_Bits.ND118 */
#define IFX_ERAY_NDAT4_ND118_OFF (22u)

/** \brief Length for Ifx_ERAY_NDAT4_Bits.ND119 */
#define IFX_ERAY_NDAT4_ND119_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDAT4_Bits.ND119 */
#define IFX_ERAY_NDAT4_ND119_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDAT4_Bits.ND119 */
#define IFX_ERAY_NDAT4_ND119_OFF (23u)

/** \brief Length for Ifx_ERAY_NDAT4_Bits.ND120 */
#define IFX_ERAY_NDAT4_ND120_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDAT4_Bits.ND120 */
#define IFX_ERAY_NDAT4_ND120_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDAT4_Bits.ND120 */
#define IFX_ERAY_NDAT4_ND120_OFF (24u)

/** \brief Length for Ifx_ERAY_NDAT4_Bits.ND121 */
#define IFX_ERAY_NDAT4_ND121_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDAT4_Bits.ND121 */
#define IFX_ERAY_NDAT4_ND121_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDAT4_Bits.ND121 */
#define IFX_ERAY_NDAT4_ND121_OFF (25u)

/** \brief Length for Ifx_ERAY_NDAT4_Bits.ND122 */
#define IFX_ERAY_NDAT4_ND122_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDAT4_Bits.ND122 */
#define IFX_ERAY_NDAT4_ND122_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDAT4_Bits.ND122 */
#define IFX_ERAY_NDAT4_ND122_OFF (26u)

/** \brief Length for Ifx_ERAY_NDAT4_Bits.ND123 */
#define IFX_ERAY_NDAT4_ND123_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDAT4_Bits.ND123 */
#define IFX_ERAY_NDAT4_ND123_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDAT4_Bits.ND123 */
#define IFX_ERAY_NDAT4_ND123_OFF (27u)

/** \brief Length for Ifx_ERAY_NDAT4_Bits.ND124 */
#define IFX_ERAY_NDAT4_ND124_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDAT4_Bits.ND124 */
#define IFX_ERAY_NDAT4_ND124_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDAT4_Bits.ND124 */
#define IFX_ERAY_NDAT4_ND124_OFF (28u)

/** \brief Length for Ifx_ERAY_NDAT4_Bits.ND125 */
#define IFX_ERAY_NDAT4_ND125_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDAT4_Bits.ND125 */
#define IFX_ERAY_NDAT4_ND125_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDAT4_Bits.ND125 */
#define IFX_ERAY_NDAT4_ND125_OFF (29u)

/** \brief Length for Ifx_ERAY_NDAT4_Bits.ND126 */
#define IFX_ERAY_NDAT4_ND126_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDAT4_Bits.ND126 */
#define IFX_ERAY_NDAT4_ND126_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDAT4_Bits.ND126 */
#define IFX_ERAY_NDAT4_ND126_OFF (30u)

/** \brief Length for Ifx_ERAY_NDAT4_Bits.ND127 */
#define IFX_ERAY_NDAT4_ND127_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDAT4_Bits.ND127 */
#define IFX_ERAY_NDAT4_ND127_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDAT4_Bits.ND127 */
#define IFX_ERAY_NDAT4_ND127_OFF (31u)

/** \brief Length for Ifx_ERAY_MBSC1_Bits.MBC0 */
#define IFX_ERAY_MBSC1_MBC0_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC1_Bits.MBC0 */
#define IFX_ERAY_MBSC1_MBC0_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC1_Bits.MBC0 */
#define IFX_ERAY_MBSC1_MBC0_OFF (0u)

/** \brief Length for Ifx_ERAY_MBSC1_Bits.MBC1 */
#define IFX_ERAY_MBSC1_MBC1_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC1_Bits.MBC1 */
#define IFX_ERAY_MBSC1_MBC1_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC1_Bits.MBC1 */
#define IFX_ERAY_MBSC1_MBC1_OFF (1u)

/** \brief Length for Ifx_ERAY_MBSC1_Bits.MBC2 */
#define IFX_ERAY_MBSC1_MBC2_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC1_Bits.MBC2 */
#define IFX_ERAY_MBSC1_MBC2_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC1_Bits.MBC2 */
#define IFX_ERAY_MBSC1_MBC2_OFF (2u)

/** \brief Length for Ifx_ERAY_MBSC1_Bits.MBC3 */
#define IFX_ERAY_MBSC1_MBC3_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC1_Bits.MBC3 */
#define IFX_ERAY_MBSC1_MBC3_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC1_Bits.MBC3 */
#define IFX_ERAY_MBSC1_MBC3_OFF (3u)

/** \brief Length for Ifx_ERAY_MBSC1_Bits.MBC4 */
#define IFX_ERAY_MBSC1_MBC4_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC1_Bits.MBC4 */
#define IFX_ERAY_MBSC1_MBC4_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC1_Bits.MBC4 */
#define IFX_ERAY_MBSC1_MBC4_OFF (4u)

/** \brief Length for Ifx_ERAY_MBSC1_Bits.MBC5 */
#define IFX_ERAY_MBSC1_MBC5_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC1_Bits.MBC5 */
#define IFX_ERAY_MBSC1_MBC5_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC1_Bits.MBC5 */
#define IFX_ERAY_MBSC1_MBC5_OFF (5u)

/** \brief Length for Ifx_ERAY_MBSC1_Bits.MBC6 */
#define IFX_ERAY_MBSC1_MBC6_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC1_Bits.MBC6 */
#define IFX_ERAY_MBSC1_MBC6_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC1_Bits.MBC6 */
#define IFX_ERAY_MBSC1_MBC6_OFF (6u)

/** \brief Length for Ifx_ERAY_MBSC1_Bits.MBC7 */
#define IFX_ERAY_MBSC1_MBC7_LEN (1u)

