Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_QSPI_TLE9180D_2/Libraries/Infra/Sfr/TC38x/IfxEray_bf.h
/** \brief Mask for Ifx_ERAY_NDIC2_Bits.NDIP42 */
#define IFX_ERAY_NDIC2_NDIP42_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDIC2_Bits.NDIP42 */
#define IFX_ERAY_NDIC2_NDIP42_OFF (10u)

/** \brief Length for Ifx_ERAY_NDIC2_Bits.NDIP43 */
#define IFX_ERAY_NDIC2_NDIP43_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDIC2_Bits.NDIP43 */
#define IFX_ERAY_NDIC2_NDIP43_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDIC2_Bits.NDIP43 */
#define IFX_ERAY_NDIC2_NDIP43_OFF (11u)

/** \brief Length for Ifx_ERAY_NDIC2_Bits.NDIP44 */
#define IFX_ERAY_NDIC2_NDIP44_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDIC2_Bits.NDIP44 */
#define IFX_ERAY_NDIC2_NDIP44_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDIC2_Bits.NDIP44 */
#define IFX_ERAY_NDIC2_NDIP44_OFF (12u)

/** \brief Length for Ifx_ERAY_NDIC2_Bits.NDIP45 */
#define IFX_ERAY_NDIC2_NDIP45_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDIC2_Bits.NDIP45 */
#define IFX_ERAY_NDIC2_NDIP45_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDIC2_Bits.NDIP45 */
#define IFX_ERAY_NDIC2_NDIP45_OFF (13u)

/** \brief Length for Ifx_ERAY_NDIC2_Bits.NDIP46 */
#define IFX_ERAY_NDIC2_NDIP46_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDIC2_Bits.NDIP46 */
#define IFX_ERAY_NDIC2_NDIP46_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDIC2_Bits.NDIP46 */
#define IFX_ERAY_NDIC2_NDIP46_OFF (14u)

/** \brief Length for Ifx_ERAY_NDIC2_Bits.NDIP47 */
#define IFX_ERAY_NDIC2_NDIP47_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDIC2_Bits.NDIP47 */
#define IFX_ERAY_NDIC2_NDIP47_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDIC2_Bits.NDIP47 */
#define IFX_ERAY_NDIC2_NDIP47_OFF (15u)

/** \brief Length for Ifx_ERAY_NDIC2_Bits.NDIP48 */
#define IFX_ERAY_NDIC2_NDIP48_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDIC2_Bits.NDIP48 */
#define IFX_ERAY_NDIC2_NDIP48_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDIC2_Bits.NDIP48 */
#define IFX_ERAY_NDIC2_NDIP48_OFF (16u)

/** \brief Length for Ifx_ERAY_NDIC2_Bits.NDIP49 */
#define IFX_ERAY_NDIC2_NDIP49_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDIC2_Bits.NDIP49 */
#define IFX_ERAY_NDIC2_NDIP49_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDIC2_Bits.NDIP49 */
#define IFX_ERAY_NDIC2_NDIP49_OFF (17u)

/** \brief Length for Ifx_ERAY_NDIC2_Bits.NDIP50 */
#define IFX_ERAY_NDIC2_NDIP50_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDIC2_Bits.NDIP50 */
#define IFX_ERAY_NDIC2_NDIP50_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDIC2_Bits.NDIP50 */
#define IFX_ERAY_NDIC2_NDIP50_OFF (18u)

/** \brief Length for Ifx_ERAY_NDIC2_Bits.NDIP51 */
#define IFX_ERAY_NDIC2_NDIP51_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDIC2_Bits.NDIP51 */
#define IFX_ERAY_NDIC2_NDIP51_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDIC2_Bits.NDIP51 */
#define IFX_ERAY_NDIC2_NDIP51_OFF (19u)

/** \brief Length for Ifx_ERAY_NDIC2_Bits.NDIP52 */
#define IFX_ERAY_NDIC2_NDIP52_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDIC2_Bits.NDIP52 */
#define IFX_ERAY_NDIC2_NDIP52_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDIC2_Bits.NDIP52 */
#define IFX_ERAY_NDIC2_NDIP52_OFF (20u)

/** \brief Length for Ifx_ERAY_NDIC2_Bits.NDIP53 */
#define IFX_ERAY_NDIC2_NDIP53_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDIC2_Bits.NDIP53 */
#define IFX_ERAY_NDIC2_NDIP53_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDIC2_Bits.NDIP53 */
#define IFX_ERAY_NDIC2_NDIP53_OFF (21u)

/** \brief Length for Ifx_ERAY_NDIC2_Bits.NDIP54 */
#define IFX_ERAY_NDIC2_NDIP54_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDIC2_Bits.NDIP54 */
#define IFX_ERAY_NDIC2_NDIP54_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDIC2_Bits.NDIP54 */
#define IFX_ERAY_NDIC2_NDIP54_OFF (22u)

/** \brief Length for Ifx_ERAY_NDIC2_Bits.NDIP55 */
#define IFX_ERAY_NDIC2_NDIP55_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDIC2_Bits.NDIP55 */
#define IFX_ERAY_NDIC2_NDIP55_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDIC2_Bits.NDIP55 */
#define IFX_ERAY_NDIC2_NDIP55_OFF (23u)

/** \brief Length for Ifx_ERAY_NDIC2_Bits.NDIP56 */
#define IFX_ERAY_NDIC2_NDIP56_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDIC2_Bits.NDIP56 */
#define IFX_ERAY_NDIC2_NDIP56_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDIC2_Bits.NDIP56 */
#define IFX_ERAY_NDIC2_NDIP56_OFF (24u)

/** \brief Length for Ifx_ERAY_NDIC2_Bits.NDIP57 */
#define IFX_ERAY_NDIC2_NDIP57_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDIC2_Bits.NDIP57 */
#define IFX_ERAY_NDIC2_NDIP57_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDIC2_Bits.NDIP57 */
#define IFX_ERAY_NDIC2_NDIP57_OFF (25u)

/** \brief Length for Ifx_ERAY_NDIC2_Bits.NDIP58 */
#define IFX_ERAY_NDIC2_NDIP58_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDIC2_Bits.NDIP58 */
#define IFX_ERAY_NDIC2_NDIP58_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDIC2_Bits.NDIP58 */
#define IFX_ERAY_NDIC2_NDIP58_OFF (26u)

/** \brief Length for Ifx_ERAY_NDIC2_Bits.NDIP59 */
#define IFX_ERAY_NDIC2_NDIP59_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDIC2_Bits.NDIP59 */
#define IFX_ERAY_NDIC2_NDIP59_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDIC2_Bits.NDIP59 */
#define IFX_ERAY_NDIC2_NDIP59_OFF (27u)

/** \brief Length for Ifx_ERAY_NDIC2_Bits.NDIP60 */
#define IFX_ERAY_NDIC2_NDIP60_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDIC2_Bits.NDIP60 */
#define IFX_ERAY_NDIC2_NDIP60_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDIC2_Bits.NDIP60 */
#define IFX_ERAY_NDIC2_NDIP60_OFF (28u)

/** \brief Length for Ifx_ERAY_NDIC2_Bits.NDIP61 */
#define IFX_ERAY_NDIC2_NDIP61_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDIC2_Bits.NDIP61 */
#define IFX_ERAY_NDIC2_NDIP61_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDIC2_Bits.NDIP61 */
#define IFX_ERAY_NDIC2_NDIP61_OFF (29u)

/** \brief Length for Ifx_ERAY_NDIC2_Bits.NDIP62 */
#define IFX_ERAY_NDIC2_NDIP62_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDIC2_Bits.NDIP62 */
#define IFX_ERAY_NDIC2_NDIP62_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDIC2_Bits.NDIP62 */
#define IFX_ERAY_NDIC2_NDIP62_OFF (30u)

/** \brief Length for Ifx_ERAY_NDIC2_Bits.NDIP63 */
#define IFX_ERAY_NDIC2_NDIP63_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDIC2_Bits.NDIP63 */
#define IFX_ERAY_NDIC2_NDIP63_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDIC2_Bits.NDIP63 */
#define IFX_ERAY_NDIC2_NDIP63_OFF (31u)

